app/views/projects/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
	<%end%>
	<% p.tasks.reverse.each do |t| %>