app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT 1
---
	def index
		@projects=Project.all.to_a

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
	def destroy
		Project.find(params[:id]).destroy