app/controllers/tasks_controller.rb

	def destroy
		Task.find(params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "2"]]

	def create
		@task = Task.create!(task_params)
---
INSERT INTO "tasks" ("created_at", "priority", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 04 Aug 2013 08:15:58 UTC +00:00], ["priority", 5], ["project_id", 1], ["title", "One More Test"], ["updated_at", Sun, 04 Aug 2013 08:15:58 UTC +00:00]]